# программу, которая принимаем на вход координаты точки (X и Y) 
# и определяем номер четверти плоскости, в которой находится эта точка

x = int(input("Введите точку Х: "))
y = int(input("Введите точку Y: "))
if x > 0 and y > 0:
    print ("x = ", (x) , "; y = ",(y), "  -》 1")
else:
    if x < 0 and y > 0:
        print ("x = ", (x) , "; y = ",(y), "  -》 2")
    else:
        if x < 0 and y < 0:
            print ("x = ", (x) , "; y = ",(y), "  -》 3")
        else:
            print ("x = ", (x) , "; y = ",(y), "  -》 4")